[
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["3.6"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/91YyKraZSJL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "53.1 pounds"], ["Product Dimensions", "56.9 x 11.4 x 36 inches"], ["Origin", "Mexico"], ["Item model number", "UN65MU8000FXZA"], ["Color Name", "Black"]], "description_html": "", "title": ["Samsung Electronics UN65MU8000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06X9VSZYM"], "extra_images": "", "reviews": [["3.0 out of 5 stars", "Nice TV, but overpriced and small annoyances.", "I recently received the 55\" MU8000 TV, and it's definitely a big step up from the KU6300 I previously had in every way. However, there are some issues that should be brought up.Pros:- Excellent blacks. Provides a very deep black picture.- Vivid colors, but it could be a bit better with its 10 bit panel.- No lightbleed at all.- Native 120Hz refresh rate / Full 24p playback.- Very nice build quality. Extremely thin bezel around the panel.- 4x HDMI 2.0 ports, and each support HDR.- Normal and UltraHD Blu-ray movies look very, very nice.- Very low input lag, which is great for gaming.- Motion handling is very good.- Excellent upscaling, especially from 1080p content.- Cable management on the back is a nice addition.- Personally, I've really liked the remotes Samsung uses, but I can see others not enjoying its simplicity. Voice control works well.- I don't use the stands which are provided, but they're of very high quality.Neutral:- Edge-lit display. Other brands are using full array back lighting at the same price or less.- I've noticed some very slight blooming, but it's only when the screen is black and a white logo/image appears.- The \"One Connect Box\" is kind of annoying. Takes up more space and requires another long cable. It works fine, but I'd rather have all ports on the TV itself.- Mounting the TV on the wall or a TV stand with a bracket can be problematic due to the shape on the rear of the TV. Does not include proper M8 screws, so be sure to measure beforehand. You must use the included standoffs. Be careful and plan ahead if you count on mounting this TV.- Be sure to plug in the power and One Connect Box cables in to the TV before mounting or fitting the TV in to a tight space. Their locations (center-bottom) are nearly impossible to reach if you mount it beforehand.- At this time, the Tizen OS can be quite laggy when navigating.- Moving the \"Game Mode\" setting to \"External Devices,\" rather than \"Picture Settings\" of the past causes a waste of time. On past Samsung TV's, it was quick and easy to switch between picture modes. Though using Voice Control helps in this situation.Cons:- Samsung claims the panel is HDR 1000 compatible (1000+ nits brightness), but in reality, it's less than 500 nits. Therefore, it's best to watch in a dimly lit room or in the dark.- HDR isn't all that great on this panel, mostly due to its subpar wide color gamut.- Very poor gradients are displayed at times, primarily when using Game Mode.- Reflections are quite bad on this set.- Poor viewing angles.- For what you get, picture and feature-wise, it's an expensive TV. Especially when other brands are using superior panels and technology at the same cost or less.- Hope that you don't have to ever deal with Samsung's TV customer support. Long story short: it's the worst support experience I've ever dealt with.Conclusion:Even though the MU8000 provides a very nice overall picture and excellent build quality, there are a couple of areas where Samsung basically used false advertising. If you can find last year's KS8000 series ($1,000 now for the 55\"), then definitely purchase that over the MU8000. It fully supports HDR 1000 and provides a much wider color gamut. The new Sony 900E series is also a much better option, picture-wise, and it's the same price as the MU8000. I simply feel that $1,500 is too much money for what this model claims to provide, but doesn't afterall. However, it is a nice package for the most part."], ["I've had this TV for a couple of months now.  It is awesome,Picture clarity is exceptional.  The darks are extremely dark.Of course, it's best with 4K content (which I can find on Netflix).But even regular HD content looks gorgeous.The SmartHub is very fast; it comes up instantaneously, and the apps load quickly.It comes with everything you may want - Netflix, Amazon, Hulu, HBO and many others for video; Pandora, Spotify, iHeartRadio and others for music. It even comes with a pretty decent Web browser, I was able to log into the Cliburn competition and watch a lot of it through the browser, with no problems and no latency at all.The built-in speakers are pretty decent, but I had it installed with a Sonos soundbar system.It is big, but not overwhelmingly so - I had it installed above a fireplace, and it fills the space but does not dominate it.  It is very thin for its size, and surprisingly not that heavy (I could lift it myself).Finally, I absolutely LOVE the remote.  It is ergonomics exemplified!  Fits very nicely in hand, has ingeniously simple controls, every button is distinct, with its own feel.  It is really exceptionally well designed.  Bravo to Samsung - it is one of the best electronic products overall I ever used, ever.I only have two complaints about the TV.  One, it does NOT have a plug for headphones.  How can a TV with all these features not have a simple little plug?  I couldn't believe it.  I had to buy a special gizmo (MPOW, which is a GREAT product - I reviewed it separately) to connect my Bose headphones to the Bluetooth output (the only option).  Minor complaint two, sometimes the apps get \"stuck.\"  A couple of times I turned off the TV while Netflix or Amazon was running, and when I turned it back on, it was not responsive to any other buttons on the remote (just on and off). I had to unplug it to \"reboot,\" then it was fine again.  It only happened a couple of times.So overall, I would buy it again, it's just awesome.", "5.0 out of 5 stars", "A great TV with a phenomenally good remote."], ["Don't listen to the reviews!", "Love this tv, don't listen to all the negative reviews. I had a JS8500 before this and I didn't think the picture could get any better but I was wrong. This TV is a huge step up in my opinion.", "5.0 out of 5 stars"], ["Five Stars", "5.0 out of 5 stars", "great picture and easy to use"], ["Live Large", "Replaced a 10 year old LCD 1080. Man, what a difference using my new FIOS hookup. Get the large remote if you're over 60.", "5.0 out of 5 stars"], ["I now own both 2016 and 2017 Samsung's 8000, a 65 inch and this 55 inch. Im no expert but the new one is sharper and blacks are really black. I'm satisfied and would recommend this TV no questions asked.", "Get one, or maybe two...", "5.0 out of 5 stars"], ["4K picture and easy setup", "5.0 out of 5 stars", "We've been very happy with our TV since receiving it. The picture quality is incredible, and the sound isn't too bad, either. We're using it with the included stand, for now, and might continue to do so once we've figured out how we want to arrange our living room. The stand is attractive and doesn't take up much space.Setup was easy, the tv includes a form of cable management on the back, so it isn't too big a mess back there. Also, connecting our peripherals to the \"hub\" was super easy."], ["The picture quality is much better than the Panasonic Plasma that I replaced. (probably because the Samsung is UHD)Installation was a PITA, because the wall mount spacers were too long. Almost lost the TV when the brackets came undone while hanging the set.Cut about 1/8 inch off all 4 spacers and reinstalled the mount with no problems. TV is still on the wall!!!Setup was extremely easy, and the One Connect Mini is really convenient for attaching the Satellite Box and DVD player. Minimal keys on the remote take some getting used to, but the voice function works well to avoid trying to find the correct menu items.For the rest of you nerds out there, you don't need any peripheral devices to connect to the TV with your computer or smart phone. If your computer supports Miracast you just need to use the connect icon in the action center, and for Android users, you just need to use the screen mirror function on the phone.", "Excellent TV if you don't want to spend a fortune", "5.0 out of 5 stars"]], "url": "https://www.amazon.com/dp/B06X9VSZYM/b/ref=nav_shopall_nav_sa_EN_SSC_Flyout?_encoding=UTF8&node=11096544011&pf_rd_p=e06b5dbf-4e1d-4406-8e0a-a2496a05fc87&pf_rd_s=nav-sa-beauty-health&pf_rd_t=4201&pf_rd_i=navbar-4201&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=ET4T76RCRD2MYP2A2FBF", "description_text": ["Every scene deserves a brilliant picture. Experience lifelike color with a billion more shades than regular 4K UHD and enjoy the expanded depth of HDR. With extreme contrast between the darkest darks and lightest lights, you never miss a detail. MR 240 brings fast action to life, and you can take it all in on a TV that's streamlined from every angle- from a sleek frame to a clean back."], "product_info": [["ASIN", "B06X9VSZYM"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "72.3 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": ["Amazon.com"], "price": 169799.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/91jCAdfDDWL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "63.9 pounds"], ["Product Dimensions", "57 x 16.4 x 36.4 inches"], ["Origin", "Mexico"], ["Item model number", "UN65MU9000FXZA"], ["Color Name", "Black"]], "description_html": "", "title": ["Samsung Electronics UN65MU9000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06XGCT2PQ"], "extra_images": "", "reviews": [["Great TV, weird choices in external wiring", "Absolutely beautiful picture and great TV. Love the ultra thin profile and the almost invisible bezel maximizing screen in no wasted space.Only knock against this is the weird external wiring from Samsung. Instead of plugging your HDMIs into the TV, they've moved to the \"One Connect\", a proprietary signal cable and hub. So you get an extra device hub you plug all your HDMI/etc into, and that sits with your other multimedia components. It connects to the TV via a generous 6' (I believe) length cord, but again with their proprietary connectors. Bizarrely, this proprietary connector doesn't include power, so you have a second wire coming down out of your tv for your power, with what seems like standard connectors. I have no clue why they went to the trouble to have a special cord and didn't just include the power in it. They should have called it the \"Two Connect\", since you have two cords, not one.Anyway, strangest of all... Samsung made these two wires (the proprietary One Connect and the power cord) LIGHT GRAY in color. I was literally shocked to discover this. Here's this expensive, fancy, ultra-thin TV (perfect for low-profile wall mounting) with black bezel and backing... and GRAY cords that stand out like a sore thumb. I guess maybe so they blend better with a (gray) wall, if you were so inclined as to just run them down the wall exposed instead of hiding them in-wall or inside a conduit? Crazy choice on Samsung's part. But overall, just a cosmetic nitpick.Great TV otherwise.", "5.0 out of 5 stars"], ["Love the TV", "Love the TV! The only issue I have is the remote control will not work with a sonos play bar.  Luckily I have DIRECTV and the remote will operate the sonos! Other than that, the TV is amazing!!", "5.0 out of 5 stars"], ["Five Stars", "fast delivery. Samsung quality decent price.", "5.0 out of 5 stars"], ["4.0 out of 5 stars", "Just bought this TV and I can't give it 5 stars because of the Samsung one connect box and issues with audio volume and home theater control.  I have the Sonos Playbar with this TV.  Proper setup took some figuring out but you can assign the Sonos as the home theater system connected via the Toshlink cable to the one connect box.Two outstanding others should be aware of:1.  If you use the FireTV you will not be able to use the Samsung remote to control the volume of the Sonos Playbar.  Apple TV and Blue-Ray plays work fine with the Samsung remote.  So now I have 2 choices: 1 - ditch the Samsung remote and buy a smart remote like a Logitec or 2 - use a tablet or phone to control the Sonos Playbar volume via the app.2.  Not sure if it is a Samsung issue or Sonos issue but the volume output to the Sonos Playbar is very low.  Have to max out the volume to get acceptable listening level.  Didn't have this issue with my older Samsung TV (didn't have Samsung One Connect box).  Based on all the other reported issues with the One Connect box, I suspect it is a Samsung issue.", "Apple TV and Blue-Ray plays work fine with the Samsung remote"], ["Love the TV with one exception.  Everything I read said that I could mirror the screen from my tablet.  Not.  Won't work with Apple products.  After speaking with Tech Support learned that as far as they knew it will only work with Samsung tablets.  Other tablets may be listed eventually, but check with Samsung first.  Also, price has come down quite a bit recently.", "Love the TV with one exception", "5.0 out of 5 stars"], ["Five Stars", "Awesome TV!", "5.0 out of 5 stars"], ["1.0 out of 5 stars", "One Connect Quality and Poor Customer Service", "I brought a Samsung TV UN65JS8500 in November 2015. Within less than a year, in September 2016 the One Connect Box is not working. They send me a replacement box. Today (June 2017) within less than a year later, the One Connect Box is not working again.I told them that the replacement One Connect Box is a lemon, it is not living up to basic electronic reliability or quality of at least one year. They refuse to take ownership of the problem or refuse to replace it again.This will be my last Samsung TV."]], "url": "https://www.amazon.com/dp/B06XGCT2PQ/ref=psdc_6459737011_t4_B06X9VSZYM", "description_text": ["The Samsung MU9000 Ultra HDTV redefines the viewing experience by producing over a billion rich colors with 4K Color Drive Extreme and Triple Black Extreme for a deeper High Dynamic Range (HDR) picture. Our new Smart TV user interface (UI), the new Smart Remote Controller with voice navigation capability provides faster access to your favorite streaming content choices and more."], "product_info": [["ASIN", "B06XGCT2PQ"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "84 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": ["Amazon.com"], "price": 199799.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.5"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/81TdkYNvmYL._SL1500_.jpg"], "product_specs": [["Brand Name", "Sony"], ["Item Weight", "77.2 pounds"], ["Product Dimensions", "69.4 x 7.5 x 37.8 inches"], ["Origin", "Mexico"], ["Item model number", "XBR-65X850E"], ["Batteries", "2 AA batteries required. (included)"], ["Color Name", "Black"]], "description_html": "", "title": ["Sony XBR65X850E 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Sony"], "stock_status": ["In Stock"], "pid": ["B01N5UZ1RG"], "extra_images": "", "reviews": [["I made this purchase after much deliberation. I had short listed this product and the Samsung curved, price wise I believe there was just a $100 difference (Sony being higher). Being a old fan of the Sony brand, I was little biased towards this brand. The product took about 2 weeks for delivery, was delivered & installed on the TV stand by the same people who delivered. Very professional service.I had purchased the wall mount service from Amazon itself and I was extremely happy with the quality of service. The technician came right the next day, did the installation in about an hour. Was little bummed when I came to know that Comcast doesn't yet stream in 4K. But in comparison to my old Phillips (10 year old 35 inch) obviously the picture quality & overall experience is stunning.I have an Sony google TV and the setup took less than 15 min to complete.One issue that I noticed is that the Sony TV remote guide although display the TV guide, it is not changing the channels. I am still researching, it is possible the way my setup is.I will post some more reviews in a while to share my experience.", "I had purchased the wall mount service from Amazon itself and I was extremely happy with the quality of service", "5.0 out of 5 stars"], ["Really was easy, picture looks great and had a movie from ...", "5.0 out of 5 stars", "After a ton of research, picked the Sony TV based on brand reputation and no past issues with Sony products.  It took about 30 minutes to setup TV (including item setup and system updates/remote setup).  Really was easy, picture looks great and had a movie from Netflix streaming in a matter of moments.  Really enjoying this set so far and highly recommend."], ["Amazing picture quality. HDR is definitely worth it!", "5.0 out of 5 stars", "Five Stars"], ["Great TV. Need 2 people to mount on wall.", "Five Stars", "5.0 out of 5 stars"], ["Fantastic picture", "Love it, easy set up. Fantastic picture. Android smart tv.", "5.0 out of 5 stars"], ["Super fast shipping. Arrived safely. What an amazing tv. Super happy with it!", "Five Stars", "5.0 out of 5 stars"], ["High quality TV", "Very happy with this TV we shopped for about a month.  The reviews were good and after going to a few local stores to compare other brands. This one won.", "5.0 out of 5 stars"], ["Excellent!  Google Android operating system is great!  I love the voice search for YouTube!With AT&T U-Verse, this TV gets the TV Guide, and preview screens for all shows from online directly, bypassing the slow AT&T set top box.  Making browsing U-Verse TV much faster!", "Excellent!  Works great with AT&T U-Verse!", "5.0 out of 5 stars"]], "url": "https://www.amazon.com/dp/B01N5UZ1RG/ref=psdc_6459737011_t3_B06X9VSZYM", "description_text": ["Go beyond what you’ve seen before with remarkable 4K HDR clarity, colour and contrast. Scenes are more detailed, more natural and more real with 4K HDR Processor X1, and life’s brilliance is revealed with extra smooth and vibrant colours. And with Android TV, find all the entertainment you want."], "product_info": [["ASIN", "B01N5UZ1RG"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "77.2 pounds ("], ["Date First Available", "February 10, 2017"]], "seller": ["Amazon.com"], "price": 159800.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/81npPmFkYVL._SL1500_.jpg"], "product_specs": [["Brand Name", "Sony"], ["Item Weight", "77.2 pounds"], ["Product Dimensions", "64.4 x 7.5 x 37.8 inches"], ["Origin", "Mexico"], ["Item model number", "XBR65X900E"], ["Batteries", "2 AAA batteries required. (included)"], ["Color Name", "Black"]], "description_html": "", "title": ["Sony XBR65X900E 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Sony"], "stock_status": ["In Stock"], "pid": ["B01MZF81NS"], "extra_images": "", "reviews": [["I held off purchasing a 4k TV until 2017 models were released hoping to get 4K and HDR at once. I originally looked at purchasing a Samsung KS8000 (2016 model) based on reviews but those are super hard to find now. I use rtings.com almost exclusively to compare different models and get the reviews on the major features I am looking for (HDR, wide color gamut, local dimming, and input lag). Based on what I was looking for, pretty much gaming with future potential for 4k Blu Ray, I went with the Sony XBRX900E. So far I am completely happy and satisfied with my choice. First off definitely research online and don't only base your decision from what you see at a local store. I always go into my local Best buy to get a first hand look but you can't know what you are actually getting unless you research online (specs like brightness, HDR, input lag, wide color gamut, etc). This TV is awesome when you have a PS4 pro and are going from no 4K and no HDR to this TV with those features. The games on PS4 pro that have been enhanced look awesome (Horizon XD, Shadow of Mordor, Deus Ex MD, NMD, Titan Fall 2, Ratchet and Clank, etc) night and day difference. No lag, HDR is awesome, colors and brightness make games more immersive. The smart capabilities of this TV are great for streaming 4k content (Amazon and YouTube). I've obviously never streamed 4k before since I didn't have a 4k TV but I find myself streaming random things in 4k just to see the beautiful picture. It's amazing how much random content is available to stream in 4K. I have a Vizio soundbar with a optical input and was concerned that I would have to use two different remotes. In the home screen (press the home button) there is a picture of what I initially thought was a random video labeled \"audio control setup\" it walks you through connecting the included RF blaster\" so you can control your sound bar with the Sony remote, nice. No complaints so far. If you have been looking for a 4K TV to pair with your PS4 pro or to view/stream 4K content this is a great choice.", "Great for PS4 Pro and streaming 4K content", "5.0 out of 5 stars"], ["I’ve had the 75” 4K HDTV for over a month now and overall it is a great set. However, upgrading from a Samsung HD TV, there are some things to note.OVERALL (the short version): I would recommend this TV for the picture quality alone. 5 Stars. It is magnificent! There are workarounds for the CONS listed below, so overall it’s a terrific set for 4K content as well as regular HD content. I’ve decided to start with the CONS to get them out of the way. The PROS follow below.CONS:The SONY BRAVIA 4K XBR75X900E does not seem to be able to handle internet speeds much higher than 60mbps (wired or connected by LAN). This is acceptable for streaming HD on the apps that accompany the set, but 4K content can be iffy. I tried viewing a Coral Reef video on Amazon Prime in 4K, and it took almost a minute for the picture to catch up to 4K quality. There were a few times the picture lagged. I tried watching a random standup comedy video on Netflix in 4K and the server wouldn’t connect. This was probably an issue with Netflix because when I tried again, the connection worked and seemed to hold a 4K picture in a similar way to the Amazon app. The YouTube app was the same. 4K videos lagged and took some time to catch up.Luckily, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) I purchased can handle faster internet speeds, so we use the player almost exclusively for streaming 4K content. I’ve also read other reviewers mention that Chromecast or an Fire TV Stick with Alexa Voice Remote | Streaming Media Player can handle higher internet streaming speeds, so that is something to consider. Also, the TV takes about a minute to connect to Wi-Fi after it’s turned on. Not a big deal, but worth noting. Connected to LAN, it connects a little quicker.Upscaling looks terrible when done on the TV. I wasn’t expecting this to be the issue, but once again, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) saved the day! Upscale regular Blu-Ray’s on the player, and the picture looks nearly as good as actual 4K. You will notice the difference. We streamed a few older shows from HULU like Cheers and Seinfeld and they looked great as well. Again, the picture quality is fantastic and worth every penny!**** HDR UPDATE ***I want to thank everyone for their comments about my negative thoughts on HDR. It forced me to do some research on the internet to figure out why HDR looked to terrible on this set. After trial and error, I finally figured it out. You see, I have a home theater system. I bought an ONKYO Receiver a few years back that was 4K compatible. I did not, however, take into consideration that it might not be HDR compatible. (It's not.) So, I was running the 4K player through an HDMI cable into the receiver first, and then into the 4K TV. Which means, no HDR content was reaching the TV. So, as one commenter pointed out, I was turning HDR on when no HDR was available, which results in my original comments below, the picture is dark and the colors look cartoonish.I WAS WRONG!! And I'm glad I was wrong. Nobody likes eating crow, but I am happy to do it after I saw HDR for the first time last night. It is awesome! The colors look amazing, the blacks are really dark, and the whites are really white. My wife and I watched Coral Reef Adventure under the Prime UHD selection from the Amazon app directly on the TV. HDR turned on automatically (as a commenter mentioned it should), and WOW!! It looked spectacular.If you, or anyone you know, is experiencing a bad picture when turning HDR on, they must first realize that not all 4K content is presented with HDR. But what really fixed my situation is this: Run the HDMI directly from the 4K Player to the HDMI \"1\" slot in the back of the TV. That's all it took to make HDR a reality, the way it was intended.I'm keeping the original comments in the review in the hopes of helping anyone else who experiences this issue. Thank you again for the comments about how HDR should work. You guys are the best!***********************************************************************************************************************************************************************************************ORIGINAL COMMENTS*HDR is terrible. This is not the fault of the set, but I want to talk about it here because it’s not worth turning on. If it works for you because of bright lighting in the room or whatever, go for it. But for my wife and I, HDR is not needed. Basically, it’s an artificial layer added to the original picture source to “enhance” things. After several days of tweaking with the settings, trying multiple HDR enabled discs, etc., the picture only got worse with HDR turned on. All it seems to do is make every scene darker, a LOT darker. The HDR effect on colors can be weird. There is a slight red push over flesh tones, and sometimes the colors appear cartoonish, like they were drawn in with crayons. It’s gimmicky, at best. So, if you’re new to 4K, and you’re worried that this set won’t support Dolby Vision, don’t worry too much about it. The 4K picture alone is beautiful you won’t be disappointed with the picture as it is.Also, on the subject of HDR: There are three options, ON, OFF, and AUTO. The only time HDR will turn on is when the HDR setting is switched specifically to ON. If set to AUTO, it might as well be set to OFF because it will never turn on automatically.**********************************************************************************************************************************************************************************************PROS:The picture is beautiful! It is a vast improvement over the regular HD picture from our older TV (which looked great as far as 1080P goes). There are many settings to tweak the set to your liking, and the LIVE FOOTBALL mode is perfect for games. When you watch 4K content, you can get up right next to the screen and see amazing details in the background. You probably don’t want to watch a movie right up close to the screen, but sometimes it’s fun to check out the details of things in the distance.My wife and I have watched Blu-Ray movies and UHD 4K movies from discs as well as streaming 4K content (using the separate 4K player), and they all look great. Regular DVD’s leave a little to be desired, but I knew that going in, so it’s not much of a surprise. What sells this set is the picture! And let’s be honest, this is what you’re looking for in a 75” 4K UHD set. It is spectacular for HD and 4K content! Spectacular!Games and Apps: I play Uncharted 4 on a regular PS4 (not the pro) and the details in color are phenomenal. WOW!! I can’t imagine the game looking any better on a PS4 Pro, but I’d have to do a side by side comparison to really tell the difference.*A NOTE ON SCREEN MIRRORING: If you have a Samsung Galaxy smartphone, it probably will not connect to the TV. The phone will locate the set, but won't connect. SOLUTION: Use Chromecast or (once again) the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model)", "The picture quality is fantastic and worth every penny!", "5.0 out of 5 stars"], ["Inky black OLED like experience at a fraction of the cost!", "I was bent on getting a 75 inch TV and I really wanted to get OLED; that left the LG TV with a $20,000 price tag. So, next, I was bent on getting a Samsung because I like the brightness of their screens. Samsung is charging $6000 for their 65\" QLED technology which is barely the next generation of technology. Looking at the Rtings website reviews for best 75 inch TVs, they mentioned that the best mid range 75 inch TV was this Sony 75\" X900E. I did the research. It is not OLED in terms of measurable quantities (it is very good) but I will tell you that the actual viewing experience is 99% of what it is with an OLED TV. The blacks are inky wet black and the the brights are amazing. I can watch this TV outside and it looks great. It very bright. The aesthetics are beautiful. It has a very small bezel, a the glass front has the same allure as fine crystal. It has plenty of adjustments for those who like to tweak and I think it looks great with the settings out of the box. The picture quality, is just amazing and again I can't stress enough how beautiful the HDR (High Dynamic Range) is. Deep rich blacks, plenty of mid tones and excellent highlights. For the price difference I would buy this TV every time and not really miss any real perceivable differences in OLED.  Sony deserves a huge compliment for creating such a beautiful TV and picture as such a great price. I got mine for approximately $3200 and that is great at this point in time.If you are looking for a beautiful TV and picture, especially one in the 75 inch class, mid range and reasonable pricing then this is your TV!", "5.0 out of 5 stars"], ["4.0 out of 5 stars", "Picture quality is wonderful and the TV was super easy to set-up.  I was disappointed that the TV didn't have component audio out.....I didn't think to check before purchasing. Also, there have been a few times when the TV would not switch from the Google OS to TV...a restart was needed. After a software update that hasn't been happening as often.  Overall, pretty happy with the TV and would purchase again.", "Great TV"]], "url": "https://www.amazon.com/dp/B01MZF81NS/ref=psdc_6459737011_t1_B06X9VSZYM", "description_text": ["Enjoy 4K HDR entertainment on our X900E with Android TV. With a full-array backlight and five times the dynamic range, this television offers incredible contrast. And with the powerful performance of the 4K HDR Processor X1, It takes even non-HDR content to near 4K HDR quality."], "product_info": [["ASIN", "B01MZF81NS"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "77.2 pounds ("], ["Date First Available", "February 10, 2017"]], "seller": ["Amazon.com"], "price": 199800.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["3.6"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/91YyKraZSJL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "53.1 pounds"], ["Product Dimensions", "56.9 x 11.4 x 36 inches"], ["Origin", "Mexico"], ["Item model number", "UN65MU8000FXZA"], ["Color Name", "Black"]], "description_html": "", "title": ["Samsung Electronics UN65MU8000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06X9VSZYM"], "extra_images": "", "reviews": [["3.0 out of 5 stars", "Nice TV, but overpriced and small annoyances.", "I recently received the 55\" MU8000 TV, and it's definitely a big step up from the KU6300 I previously had in every way. However, there are some issues that should be brought up.Pros:- Excellent blacks. Provides a very deep black picture.- Vivid colors, but it could be a bit better with its 10 bit panel.- No lightbleed at all.- Native 120Hz refresh rate / Full 24p playback.- Very nice build quality. Extremely thin bezel around the panel.- 4x HDMI 2.0 ports, and each support HDR.- Normal and UltraHD Blu-ray movies look very, very nice.- Very low input lag, which is great for gaming.- Motion handling is very good.- Excellent upscaling, especially from 1080p content.- Cable management on the back is a nice addition.- Personally, I've really liked the remotes Samsung uses, but I can see others not enjoying its simplicity. Voice control works well.- I don't use the stands which are provided, but they're of very high quality.Neutral:- Edge-lit display. Other brands are using full array back lighting at the same price or less.- I've noticed some very slight blooming, but it's only when the screen is black and a white logo/image appears.- The \"One Connect Box\" is kind of annoying. Takes up more space and requires another long cable. It works fine, but I'd rather have all ports on the TV itself.- Mounting the TV on the wall or a TV stand with a bracket can be problematic due to the shape on the rear of the TV. Does not include proper M8 screws, so be sure to measure beforehand. You must use the included standoffs. Be careful and plan ahead if you count on mounting this TV.- Be sure to plug in the power and One Connect Box cables in to the TV before mounting or fitting the TV in to a tight space. Their locations (center-bottom) are nearly impossible to reach if you mount it beforehand.- At this time, the Tizen OS can be quite laggy when navigating.- Moving the \"Game Mode\" setting to \"External Devices,\" rather than \"Picture Settings\" of the past causes a waste of time. On past Samsung TV's, it was quick and easy to switch between picture modes. Though using Voice Control helps in this situation.Cons:- Samsung claims the panel is HDR 1000 compatible (1000+ nits brightness), but in reality, it's less than 500 nits. Therefore, it's best to watch in a dimly lit room or in the dark.- HDR isn't all that great on this panel, mostly due to its subpar wide color gamut.- Very poor gradients are displayed at times, primarily when using Game Mode.- Reflections are quite bad on this set.- Poor viewing angles.- For what you get, picture and feature-wise, it's an expensive TV. Especially when other brands are using superior panels and technology at the same cost or less.- Hope that you don't have to ever deal with Samsung's TV customer support. Long story short: it's the worst support experience I've ever dealt with.Conclusion:Even though the MU8000 provides a very nice overall picture and excellent build quality, there are a couple of areas where Samsung basically used false advertising. If you can find last year's KS8000 series ($1,000 now for the 55\"), then definitely purchase that over the MU8000. It fully supports HDR 1000 and provides a much wider color gamut. The new Sony 900E series is also a much better option, picture-wise, and it's the same price as the MU8000. I simply feel that $1,500 is too much money for what this model claims to provide, but doesn't afterall. However, it is a nice package for the most part."], ["I've had this TV for a couple of months now.  It is awesome,Picture clarity is exceptional.  The darks are extremely dark.Of course, it's best with 4K content (which I can find on Netflix).But even regular HD content looks gorgeous.The SmartHub is very fast; it comes up instantaneously, and the apps load quickly.It comes with everything you may want - Netflix, Amazon, Hulu, HBO and many others for video; Pandora, Spotify, iHeartRadio and others for music. It even comes with a pretty decent Web browser, I was able to log into the Cliburn competition and watch a lot of it through the browser, with no problems and no latency at all.The built-in speakers are pretty decent, but I had it installed with a Sonos soundbar system.It is big, but not overwhelmingly so - I had it installed above a fireplace, and it fills the space but does not dominate it.  It is very thin for its size, and surprisingly not that heavy (I could lift it myself).Finally, I absolutely LOVE the remote.  It is ergonomics exemplified!  Fits very nicely in hand, has ingeniously simple controls, every button is distinct, with its own feel.  It is really exceptionally well designed.  Bravo to Samsung - it is one of the best electronic products overall I ever used, ever.I only have two complaints about the TV.  One, it does NOT have a plug for headphones.  How can a TV with all these features not have a simple little plug?  I couldn't believe it.  I had to buy a special gizmo (MPOW, which is a GREAT product - I reviewed it separately) to connect my Bose headphones to the Bluetooth output (the only option).  Minor complaint two, sometimes the apps get \"stuck.\"  A couple of times I turned off the TV while Netflix or Amazon was running, and when I turned it back on, it was not responsive to any other buttons on the remote (just on and off). I had to unplug it to \"reboot,\" then it was fine again.  It only happened a couple of times.So overall, I would buy it again, it's just awesome.", "5.0 out of 5 stars", "A great TV with a phenomenally good remote."], ["Don't listen to the reviews!", "Love this tv, don't listen to all the negative reviews. I had a JS8500 before this and I didn't think the picture could get any better but I was wrong. This TV is a huge step up in my opinion.", "5.0 out of 5 stars"], ["Five Stars", "5.0 out of 5 stars", "great picture and easy to use"], ["Live Large", "Replaced a 10 year old LCD 1080. Man, what a difference using my new FIOS hookup. Get the large remote if you're over 60.", "5.0 out of 5 stars"], ["I now own both 2016 and 2017 Samsung's 8000, a 65 inch and this 55 inch. Im no expert but the new one is sharper and blacks are really black. I'm satisfied and would recommend this TV no questions asked.", "Get one, or maybe two...", "5.0 out of 5 stars"], ["4K picture and easy setup", "5.0 out of 5 stars", "We've been very happy with our TV since receiving it. The picture quality is incredible, and the sound isn't too bad, either. We're using it with the included stand, for now, and might continue to do so once we've figured out how we want to arrange our living room. The stand is attractive and doesn't take up much space.Setup was easy, the tv includes a form of cable management on the back, so it isn't too big a mess back there. Also, connecting our peripherals to the \"hub\" was super easy."], ["The picture quality is much better than the Panasonic Plasma that I replaced. (probably because the Samsung is UHD)Installation was a PITA, because the wall mount spacers were too long. Almost lost the TV when the brackets came undone while hanging the set.Cut about 1/8 inch off all 4 spacers and reinstalled the mount with no problems. TV is still on the wall!!!Setup was extremely easy, and the One Connect Mini is really convenient for attaching the Satellite Box and DVD player. Minimal keys on the remote take some getting used to, but the voice function works well to avoid trying to find the correct menu items.For the rest of you nerds out there, you don't need any peripheral devices to connect to the TV with your computer or smart phone. If your computer supports Miracast you just need to use the connect icon in the action center, and for Android users, you just need to use the screen mirror function on the phone.", "Excellent TV if you don't want to spend a fortune", "5.0 out of 5 stars"]], "url": "https://www.amazon.com/dp/B06X9VSZYM/140-2324843-6825418?_encoding=UTF8&ref_=de_a_smtd&showDetailTechData=1", "description_text": ["Every scene deserves a brilliant picture. Experience lifelike color with a billion more shades than regular 4K UHD and enjoy the expanded depth of HDR. With extreme contrast between the darkest darks and lightest lights, you never miss a detail. MR 240 brings fast action to life, and you can take it all in on a TV that's streamlined from every angle- from a sleek frame to a clean back."], "product_info": [["ASIN", "B06X9VSZYM"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "72.3 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": ["Amazon.com"], "price": 169799.0, "size": ["65-Inch"]},
{"category": [], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/71fSFmUVZSL._SL1000_.jpg"], "product_specs": [], "description_html": "", "title": ["Kindle Oasis E-reader with Leather Charging Cover - Black, 6\" High-Resolution Display (300 ppi), Wi-Fi - Includes Special Offers"], "color": ["Black"], "brand": [], "stock_status": ["In Stock"], "pid": ["B00REQKWGA"], "extra_images": "", "reviews": [], "url": "https://www.amazon.com/dp/B00REQKWGA/ref=nav_shopall_ods_gno_eink_msct_L?pf_rd_p=c85dbc04-1206-4366-9596-c20336072d01&pf_rd_s=nav-sa-kindle-reader&pf_rd_t=4201&pf_rd_i=navbar-4201&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=2EEMSF9120MJN350Z8PA", "description_text": [], "product_info": [], "seller": ["Amazon Digital Services LLC"], "price": 28999.0, "size": []},
{"category": [], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/71fSFmUVZSL._SL1000_.jpg"], "product_specs": [], "description_html": "", "title": ["Kindle Oasis E-reader with Leather Charging Cover - Black, 6\" High-Resolution Display (300 ppi), Wi-Fi - Includes Special Offers"], "color": ["Black"], "brand": [], "stock_status": ["In Stock"], "pid": ["B00REQKWGA"], "extra_images": "", "reviews": [], "url": "https://www.amazon.com/dp/B00REQKWGA/ref=nav_shopall_ods_gno_eink_msct_L?pf_rd_p=c85dbc04-1206-4366-9596-c20336072d01&pf_rd_s=nav-sa-kindle-reader&pf_rd_t=4201&pf_rd_i=navbar-4201&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=J08RVAZHJH870MFCK4MD", "description_text": [], "product_info": [], "seller": ["Amazon Digital Services LLC"], "price": 28999.0, "size": []}
][
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/81npPmFkYVL._SL1500_.jpg"], "product_specs": [["Brand Name", "Sony"], ["Item Weight", "77.2 pounds"], ["Product Dimensions", "64.4 x 7.5 x 37.8 inches"], ["Origin", "Mexico"], ["Item model number", "XBR65X900E"], ["Batteries", "2 AAA batteries required. (included)"], ["Color Name", "Black"]], "description_html": "", "title": ["Sony XBR65X900E 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Sony"], "stock_status": ["In Stock"], "pid": ["B01MZF81NS"], "extra_images": "", "reviews": [["5.0", "I held off purchasing a 4k TV until 2017 models were released hoping to get 4K and HDR at once. I originally looked at purchasing a Samsung KS8000 (2016 model) based on reviews but those are super hard to find now. I use rtings.com almost exclusively to compare different models and get the reviews on the major features I am looking for (HDR, wide color gamut, local dimming, and input lag). Based on what I was looking for, pretty much gaming with future potential for 4k Blu Ray, I went with the Sony XBRX900E. So far I am completely happy and satisfied with my choice. First off definitely research online and don't only base your decision from what you see at a local store. I always go into my local Best buy to get a first hand look but you can't know what you are actually getting unless you research online (specs like brightness, HDR, input lag, wide color gamut, etc). This TV is awesome when you have a PS4 pro and are going from no 4K and no HDR to this TV with those features. The games on PS4 pro that have been enhanced look awesome (Horizon XD, Shadow of Mordor, Deus Ex MD, NMD, Titan Fall 2, Ratchet and Clank, etc) night and day difference. No lag, HDR is awesome, colors and brightness make games more immersive. The smart capabilities of this TV are great for streaming 4k content (Amazon and YouTube). I've obviously never streamed 4k before since I didn't have a 4k TV but I find myself streaming random things in 4k just to see the beautiful picture. It's amazing how much random content is available to stream in 4K. I have a Vizio soundbar with a optical input and was concerned that I would have to use two different remotes. In the home screen (press the home button) there is a picture of what I initially thought was a random video labeled \"audio control setup\" it walks you through connecting the included RF blaster\" so you can control your sound bar with the Sony remote, nice. No complaints so far. If you have been looking for a 4K TV to pair with your PS4 pro or to view/stream 4K content this is a great choice.", "Great for PS4 Pro and streaming 4K content"], ["5.0", "I’ve had the 75” 4K HDTV for over a month now and overall it is a great set. However, upgrading from a Samsung HD TV, there are some things to note.OVERALL (the short version): I would recommend this TV for the picture quality alone. 5 Stars. It is magnificent! There are workarounds for the CONS listed below, so overall it’s a terrific set for 4K content as well as regular HD content. I’ve decided to start with the CONS to get them out of the way. The PROS follow below.CONS:The SONY BRAVIA 4K XBR75X900E does not seem to be able to handle internet speeds much higher than 60mbps (wired or connected by LAN). This is acceptable for streaming HD on the apps that accompany the set, but 4K content can be iffy. I tried viewing a Coral Reef video on Amazon Prime in 4K, and it took almost a minute for the picture to catch up to 4K quality. There were a few times the picture lagged. I tried watching a random standup comedy video on Netflix in 4K and the server wouldn’t connect. This was probably an issue with Netflix because when I tried again, the connection worked and seemed to hold a 4K picture in a similar way to the Amazon app. The YouTube app was the same. 4K videos lagged and took some time to catch up.Luckily, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) I purchased can handle faster internet speeds, so we use the player almost exclusively for streaming 4K content. I’ve also read other reviewers mention that Chromecast or an Fire TV Stick with Alexa Voice Remote | Streaming Media Player can handle higher internet streaming speeds, so that is something to consider. Also, the TV takes about a minute to connect to Wi-Fi after it’s turned on. Not a big deal, but worth noting. Connected to LAN, it connects a little quicker.Upscaling looks terrible when done on the TV. I wasn’t expecting this to be the issue, but once again, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) saved the day! Upscale regular Blu-Ray’s on the player, and the picture looks nearly as good as actual 4K. You will notice the difference. We streamed a few older shows from HULU like Cheers and Seinfeld and they looked great as well. Again, the picture quality is fantastic and worth every penny!**** HDR UPDATE ***I want to thank everyone for their comments about my negative thoughts on HDR. It forced me to do some research on the internet to figure out why HDR looked to terrible on this set. After trial and error, I finally figured it out. You see, I have a home theater system. I bought an ONKYO Receiver a few years back that was 4K compatible. I did not, however, take into consideration that it might not be HDR compatible. (It's not.) So, I was running the 4K player through an HDMI cable into the receiver first, and then into the 4K TV. Which means, no HDR content was reaching the TV. So, as one commenter pointed out, I was turning HDR on when no HDR was available, which results in my original comments below, the picture is dark and the colors look cartoonish.I WAS WRONG!! And I'm glad I was wrong. Nobody likes eating crow, but I am happy to do it after I saw HDR for the first time last night. It is awesome! The colors look amazing, the blacks are really dark, and the whites are really white. My wife and I watched Coral Reef Adventure under the Prime UHD selection from the Amazon app directly on the TV. HDR turned on automatically (as a commenter mentioned it should), and WOW!! It looked spectacular.If you, or anyone you know, is experiencing a bad picture when turning HDR on, they must first realize that not all 4K content is presented with HDR. But what really fixed my situation is this: Run the HDMI directly from the 4K Player to the HDMI \"1\" slot in the back of the TV. That's all it took to make HDR a reality, the way it was intended.I'm keeping the original comments in the review in the hopes of helping anyone else who experiences this issue. Thank you again for the comments about how HDR should work. You guys are the best!***********************************************************************************************************************************************************************************************ORIGINAL COMMENTS*HDR is terrible. This is not the fault of the set, but I want to talk about it here because it’s not worth turning on. If it works for you because of bright lighting in the room or whatever, go for it. But for my wife and I, HDR is not needed. Basically, it’s an artificial layer added to the original picture source to “enhance” things. After several days of tweaking with the settings, trying multiple HDR enabled discs, etc., the picture only got worse with HDR turned on. All it seems to do is make every scene darker, a LOT darker. The HDR effect on colors can be weird. There is a slight red push over flesh tones, and sometimes the colors appear cartoonish, like they were drawn in with crayons. It’s gimmicky, at best. So, if you’re new to 4K, and you’re worried that this set won’t support Dolby Vision, don’t worry too much about it. The 4K picture alone is beautiful you won’t be disappointed with the picture as it is.Also, on the subject of HDR: There are three options, ON, OFF, and AUTO. The only time HDR will turn on is when the HDR setting is switched specifically to ON. If set to AUTO, it might as well be set to OFF because it will never turn on automatically.**********************************************************************************************************************************************************************************************PROS:The picture is beautiful! It is a vast improvement over the regular HD picture from our older TV (which looked great as far as 1080P goes). There are many settings to tweak the set to your liking, and the LIVE FOOTBALL mode is perfect for games. When you watch 4K content, you can get up right next to the screen and see amazing details in the background. You probably don’t want to watch a movie right up close to the screen, but sometimes it’s fun to check out the details of things in the distance.My wife and I have watched Blu-Ray movies and UHD 4K movies from discs as well as streaming 4K content (using the separate 4K player), and they all look great. Regular DVD’s leave a little to be desired, but I knew that going in, so it’s not much of a surprise. What sells this set is the picture! And let’s be honest, this is what you’re looking for in a 75” 4K UHD set. It is spectacular for HD and 4K content! Spectacular!Games and Apps: I play Uncharted 4 on a regular PS4 (not the pro) and the details in color are phenomenal. WOW!! I can’t imagine the game looking any better on a PS4 Pro, but I’d have to do a side by side comparison to really tell the difference.*A NOTE ON SCREEN MIRRORING: If you have a Samsung Galaxy smartphone, it probably will not connect to the TV. The phone will locate the set, but won't connect. SOLUTION: Use Chromecast or (once again) the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model)", "The picture quality is fantastic and worth every penny!"], ["5.0", "Inky black OLED like experience at a fraction of the cost!", "I was bent on getting a 75 inch TV and I really wanted to get OLED; that left the LG TV with a $20,000 price tag. So, next, I was bent on getting a Samsung because I like the brightness of their screens. Samsung is charging $6000 for their 65\" QLED technology which is barely the next generation of technology. Looking at the Rtings website reviews for best 75 inch TVs, they mentioned that the best mid range 75 inch TV was this Sony 75\" X900E. I did the research. It is not OLED in terms of measurable quantities (it is very good) but I will tell you that the actual viewing experience is 99% of what it is with an OLED TV. The blacks are inky wet black and the the brights are amazing. I can watch this TV outside and it looks great. It very bright. The aesthetics are beautiful. It has a very small bezel, a the glass front has the same allure as fine crystal. It has plenty of adjustments for those who like to tweak and I think it looks great with the settings out of the box. The picture quality, is just amazing and again I can't stress enough how beautiful the HDR (High Dynamic Range) is. Deep rich blacks, plenty of mid tones and excellent highlights. For the price difference I would buy this TV every time and not really miss any real perceivable differences in OLED.  Sony deserves a huge compliment for creating such a beautiful TV and picture as such a great price. I got mine for approximately $3200 and that is great at this point in time.If you are looking for a beautiful TV and picture, especially one in the 75 inch class, mid range and reasonable pricing then this is your TV!"], ["Picture quality is wonderful and the TV was super easy to set-up.  I was disappointed that the TV didn't have component audio out.....I didn't think to check before purchasing. Also, there have been a few times when the TV would not switch from the Google OS to TV...a restart was needed. After a software update that hasn't been happening as often.  Overall, pretty happy with the TV and would purchase again.", "4.0", "Great TV"]], "url": "https://www.amazon.com/dp/B01MZF81NS/ref=psdc_6459737011_t1_B06X9VSZYM", "description_text": ["Enjoy 4K HDR entertainment on our X900E with Android TV. With a full-array backlight and five times the dynamic range, this television offers incredible contrast. And with the powerful performance of the 4K HDR Processor X1, It takes even non-HDR content to near 4K HDR quality."], "product_info": [["ASIN", "B01MZF81NS"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "77.2 pounds ("], ["Date First Available", "February 10, 2017"]], "seller": ["Amazon.com"], "price": 199800.0, "size": ["65-Inch"]}[
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["3.6"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/91YyKraZSJL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "53.1 pounds"], ["Product Dimensions", "56.9 x 11.4 x 36 inches"], ["Origin", "Mexico"], ["Item model number", "UN65MU8000FXZA"], ["Color Name", "Black"]], "description_html": "", "title": ["Samsung Electronics UN65MU8000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06X9VSZYM"], "extra_images": "", "reviews": [["Nice TV, but overpriced and small annoyances.", "3.0", "I recently received the 55\" MU8000 TV, and it's definitely a big step up from the KU6300 I previously had in every way. However, there are some issues that should be brought up.Pros:- Excellent blacks. Provides a very deep black picture.- Vivid colors, but it could be a bit better with its 10 bit panel.- No lightbleed at all.- Native 120Hz refresh rate / Full 24p playback.- Very nice build quality. Extremely thin bezel around the panel.- 4x HDMI 2.0 ports, and each support HDR.- Normal and UltraHD Blu-ray movies look very, very nice.- Very low input lag, which is great for gaming.- Motion handling is very good.- Excellent upscaling, especially from 1080p content.- Cable management on the back is a nice addition.- Personally, I've really liked the remotes Samsung uses, but I can see others not enjoying its simplicity. Voice control works well.- I don't use the stands which are provided, but they're of very high quality.Neutral:- Edge-lit display. Other brands are using full array back lighting at the same price or less.- I've noticed some very slight blooming, but it's only when the screen is black and a white logo/image appears.- The \"One Connect Box\" is kind of annoying. Takes up more space and requires another long cable. It works fine, but I'd rather have all ports on the TV itself.- Mounting the TV on the wall or a TV stand with a bracket can be problematic due to the shape on the rear of the TV. Does not include proper M8 screws, so be sure to measure beforehand. You must use the included standoffs. Be careful and plan ahead if you count on mounting this TV.- Be sure to plug in the power and One Connect Box cables in to the TV before mounting or fitting the TV in to a tight space. Their locations (center-bottom) are nearly impossible to reach if you mount it beforehand.- At this time, the Tizen OS can be quite laggy when navigating.- Moving the \"Game Mode\" setting to \"External Devices,\" rather than \"Picture Settings\" of the past causes a waste of time. On past Samsung TV's, it was quick and easy to switch between picture modes. Though using Voice Control helps in this situation.Cons:- Samsung claims the panel is HDR 1000 compatible (1000+ nits brightness), but in reality, it's less than 500 nits. Therefore, it's best to watch in a dimly lit room or in the dark.- HDR isn't all that great on this panel, mostly due to its subpar wide color gamut.- Very poor gradients are displayed at times, primarily when using Game Mode.- Reflections are quite bad on this set.- Poor viewing angles.- For what you get, picture and feature-wise, it's an expensive TV. Especially when other brands are using superior panels and technology at the same cost or less.- Hope that you don't have to ever deal with Samsung's TV customer support. Long story short: it's the worst support experience I've ever dealt with.Conclusion:Even though the MU8000 provides a very nice overall picture and excellent build quality, there are a couple of areas where Samsung basically used false advertising. If you can find last year's KS8000 series ($1,000 now for the 55\"), then definitely purchase that over the MU8000. It fully supports HDR 1000 and provides a much wider color gamut. The new Sony 900E series is also a much better option, picture-wise, and it's the same price as the MU8000. I simply feel that $1,500 is too much money for what this model claims to provide, but doesn't afterall. However, it is a nice package for the most part."], ["5.0", "I've had this TV for a couple of months now.  It is awesome,Picture clarity is exceptional.  The darks are extremely dark.Of course, it's best with 4K content (which I can find on Netflix).But even regular HD content looks gorgeous.The SmartHub is very fast; it comes up instantaneously, and the apps load quickly.It comes with everything you may want - Netflix, Amazon, Hulu, HBO and many others for video; Pandora, Spotify, iHeartRadio and others for music. It even comes with a pretty decent Web browser, I was able to log into the Cliburn competition and watch a lot of it through the browser, with no problems and no latency at all.The built-in speakers are pretty decent, but I had it installed with a Sonos soundbar system.It is big, but not overwhelmingly so - I had it installed above a fireplace, and it fills the space but does not dominate it.  It is very thin for its size, and surprisingly not that heavy (I could lift it myself).Finally, I absolutely LOVE the remote.  It is ergonomics exemplified!  Fits very nicely in hand, has ingeniously simple controls, every button is distinct, with its own feel.  It is really exceptionally well designed.  Bravo to Samsung - it is one of the best electronic products overall I ever used, ever.I only have two complaints about the TV.  One, it does NOT have a plug for headphones.  How can a TV with all these features not have a simple little plug?  I couldn't believe it.  I had to buy a special gizmo (MPOW, which is a GREAT product - I reviewed it separately) to connect my Bose headphones to the Bluetooth output (the only option).  Minor complaint two, sometimes the apps get \"stuck.\"  A couple of times I turned off the TV while Netflix or Amazon was running, and when I turned it back on, it was not responsive to any other buttons on the remote (just on and off). I had to unplug it to \"reboot,\" then it was fine again.  It only happened a couple of times.So overall, I would buy it again, it's just awesome.", "A great TV with a phenomenally good remote."], ["5.0", "Don't listen to the reviews!", "Love this tv, don't listen to all the negative reviews. I had a JS8500 before this and I didn't think the picture could get any better but I was wrong. This TV is a huge step up in my opinion."], ["5.0", "Five Stars", "great picture and easy to use"], ["5.0", "Live Large", "Replaced a 10 year old LCD 1080. Man, what a difference using my new FIOS hookup. Get the large remote if you're over 60."], ["I now own both 2016 and 2017 Samsung's 8000, a 65 inch and this 55 inch. Im no expert but the new one is sharper and blacks are really black. I'm satisfied and would recommend this TV no questions asked.", "5.0", "Get one, or maybe two..."], ["5.0", "4K picture and easy setup", "We've been very happy with our TV since receiving it. The picture quality is incredible, and the sound isn't too bad, either. We're using it with the included stand, for now, and might continue to do so once we've figured out how we want to arrange our living room. The stand is attractive and doesn't take up much space.Setup was easy, the tv includes a form of cable management on the back, so it isn't too big a mess back there. Also, connecting our peripherals to the \"hub\" was super easy."], ["5.0", "The picture quality is much better than the Panasonic Plasma that I replaced. (probably because the Samsung is UHD)Installation was a PITA, because the wall mount spacers were too long. Almost lost the TV when the brackets came undone while hanging the set.Cut about 1/8 inch off all 4 spacers and reinstalled the mount with no problems. TV is still on the wall!!!Setup was extremely easy, and the One Connect Mini is really convenient for attaching the Satellite Box and DVD player. Minimal keys on the remote take some getting used to, but the voice function works well to avoid trying to find the correct menu items.For the rest of you nerds out there, you don't need any peripheral devices to connect to the TV with your computer or smart phone. If your computer supports Miracast you just need to use the connect icon in the action center, and for Android users, you just need to use the screen mirror function on the phone.", "Excellent TV if you don't want to spend a fortune"]], "url": "https://www.amazon.com/dp/B06X9VSZYM/b/ref=nav_shopall_nav_sa_EN_SSC_Flyout?_encoding=UTF8&node=11096544011&pf_rd_p=e06b5dbf-4e1d-4406-8e0a-a2496a05fc87&pf_rd_s=nav-sa-beauty-health&pf_rd_t=4201&pf_rd_i=navbar-4201&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=52HW7ADS1HN5VVMX97QX", "description_text": ["Every scene deserves a brilliant picture. Experience lifelike color with a billion more shades than regular 4K UHD and enjoy the expanded depth of HDR. With extreme contrast between the darkest darks and lightest lights, you never miss a detail. MR 240 brings fast action to life, and you can take it all in on a TV that's streamlined from every angle- from a sleek frame to a clean back."], "product_info": [["ASIN", "B06X9VSZYM"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "72.3 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": ["Amazon.com"], "price": 169799.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["3.9"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/A1UBLTuRLlL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "58.9 pounds"], ["Product Dimensions", "57.3 x 15.1 x 36.2 inches"], ["Item model number", "UN65MU7000FXZA"], ["Color Name", "Silver"]], "description_html": "", "title": ["Samsung Electronics UN65MU7000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06XGFYT94"], "extra_images": "", "reviews": [["4.0", "Pros:__________-  What you expect in a Samsung design: slick, clean, and light.-  I do like the titan sliver Y stands as they do provide a decent amount of stability if you’re not going to put it on the wall.-  The color balance is extremely accurate when launching it up for the first time. I didn’t feel that I had to change the layout.-  Saturated reds, blues, greens are well in their levels and no matter how high the brightness level I make it these primary color still perform beautifully.-  No neutral pixels you’re going to find on this screen.  By connecting my laptop to show off HD screensavers, this TV brought the incredible color detail of each one (an array of colors).-  Yes, 4K is shown in all its glory when you get this.-  Samsung Smarthub layout is pretty easy to master as connecting your Netflix account and even internet browsing is pretty simple to do (I still prefer google chrome since my phone will always be near me).-  HDR is indeed a great experience to see when the lights are turned down.  My HDR experience from Amazon as it’s currently one of the few that can give you the option to see its show under the HDR experience.-  Found it really cool when I turn on my PS4 it immediately switches the display layout to its game mode without me even lifting the remote.-  Playing GTA 5 I didn’t see any lag that’s enough to make a notice about (Beautiful experience when driving a car in GTA.).-  All you need is to download Miracast on your computer and that’s it. I was able to connect to it right away.-  Oneremote controller buttons have a nice push and they don't have any discomforts as you can everything you need if you don’t have your phone, laptop, or your gaming counsel around.-  It's future proof, this is not a 4 year and be done with it.  You will be good for a while.Cons and Oks:__________-  There are hardware glitches upon digging deeper into the system.  Scrolling with the remote does have some notice lag as well as sometimes I have to press an option twice to get a layout to open.  I would assume future updates will fix this issue.-  A decent amount of input layouts to get where you need to go.  It’s a learning curve as it’s something you’re not going to learn in a day.-  Playing HDR content the brightness isn’t the best around.  It’s not bright at all and it’s something to take note if you’re planning to put this in an open floor panel.-  The viewing angles are not good as I notice that the picture quality depletes if you move, from the center to the left and right of the screen.  I would think after 6 feet away from the center you’re going to see a loss in quality (It's really not the much, but something you should know.)-  Pretty expensive given what the market is offering for the same in software quality.-  The brightness issue throughout the television is something to note, this is not only HDR.-  The black levels are good but I’m sorry, OLED TVs excel in this area.-  The remote itself can’t always be reliable as I recommend you use your phone for most of the interaction.Bottom Line:__________Samsung has provided a great design and picture quality for this and it’s indeed future proof.  The color content is spot on and integrated smart TV with 4k is a bundle of joy.  Put it on the wall and it’ll look like a picture while the HDR experience will prepare you for the future of viewing.There are some hiccups that need to be addressed with this design as HDR isn’t much on the market yet and shouldn’t be a must have feature right now (will be in the future).  Software glitches and brightness issues are something to take note when buying this layout.  You will have lag sometimes when using the remote as I try to get the most of my experience with the phone. Not only that but you will find cheaper TV’s with the same layout that this one has.Overall these cons are really not significant to change your mind as the main question you need to ask is whether you prefer OLED instead.  As a Samsung user for many years, each TV made by them will hold its ground well beyond the expected breaking point.  They put great care into making their TV’s and is why the brand is one reason you need to take into account before you buy.  Verdict: A beautiful TV with an indecent price layout, given what the market is spitting out.Hopefully I was a help to you.Love,Honest Reviewer", "The Pros, Cons and Oks for Samsung's UN40MU7000 (HR)."], ["5.0", "This TV is amazing. The colors and brightness are superb", "This TV is amazing. The colors and brightness are superb. I use it with my Ps4 Pro and my Pc at full 4K HDR. The text are sharp and colors are perfect. The sounds is... well I don't expect much from stock speakers on a TV this thin. It does have optical out but not analogue out, so keep that in mind to make sure it's compatible with your sound bar.This is pricey but for what you get really your only option in the TV space right now is the Sony 800, which is around the same price depending on where you get it. However, if you see them side by like the local store had them on display, there really is no comparison. The Sony is nice on it's own but cannot match the brightness and style of this Samsung.As a monitor it is really nice, it is only 60Hz, so you professional gamers may not be satisfied, but for us mere mortals this is great. I really couldn't tell the input lag difference from my monitor."], ["5.0", "Samsung Electronics UN40MU7000 40-Inch 4K Ultra HD Smart LED TV (2017 Model)This entry level 40-inch UHD TV fits my budget and my needs. I'm a run-of-the-mill streaming, over-the-air TV, and DVD (sometimes VHS) viewer and don't want to spend time with dozens upon dozens of settings, plus I don't have space for a larger screen. I've seen others use it for gaming and heard no complaints about jitter and lag.", "Good entry level 40-inch UHD TV"], ["5.0", "Love this TV. Has all the features I want and some I do not need. It interfaces perfectly with my A/V receiver and cable box. Good picture too and looks nice. I did not think I would like the small silver border but I do. It does not stand out like a black border does so it blends into the background well. Good value for the money.", "Great TV"], ["5.0", "Excellent TV, I don't sue the smart features as I have an Apple TV hanging off of it, but working great. Great picture quality, excellent design. Speakers are marginal. Built in scaler is pretty good.", "Excellent TV, I don't sue the smart features as ..."], ["5.0", "Great HD Not to Break the Bank.", "TV works great.  Plug and Play.  I'm a Samsung guy I guess.  Sound is not bad.  I have a Denon Receiver so sound would not have broken this deal anyway."], ["5.0", "Five Stars", "Great picture and sound, was easy to setup.  Met all of my expectations."], ["5.0", "Five Stars", "best 40\" TV on the market"]], "url": "https://www.amazon.com/dp/B06XGFYT94/ref=psdc_6459737011_t5_B06X9VSZYM", "description_text": ["The Samsung MU7000 Ultra HDTV redefines the viewing experience by producing a wider range of colors with 4K Color Drive Pro and a High Dynamic Range (HDR) picture. Our new Smart TV user-interface (UI), the new Smart Remote Controller with voice navigation capability provides faster access to your favorite streaming content choices and more."], "product_info": [["ASIN", "B06XGFYT94"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "80 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": [], "price": null, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/91jCAdfDDWL._SL1500_.jpg"], "product_specs": [["Brand Name", "Samsung"], ["Item Weight", "63.9 pounds"], ["Product Dimensions", "57 x 16.4 x 36.4 inches"], ["Origin", "Mexico"], ["Item model number", "UN65MU9000FXZA"], ["Color Name", "Black"]], "description_html": "", "title": ["Samsung Electronics UN65MU9000 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Samsung"], "stock_status": ["In Stock"], "pid": ["B06XGCT2PQ"], "extra_images": "", "reviews": [["5.0", "Great TV, weird choices in external wiring", "Absolutely beautiful picture and great TV. Love the ultra thin profile and the almost invisible bezel maximizing screen in no wasted space.Only knock against this is the weird external wiring from Samsung. Instead of plugging your HDMIs into the TV, they've moved to the \"One Connect\", a proprietary signal cable and hub. So you get an extra device hub you plug all your HDMI/etc into, and that sits with your other multimedia components. It connects to the TV via a generous 6' (I believe) length cord, but again with their proprietary connectors. Bizarrely, this proprietary connector doesn't include power, so you have a second wire coming down out of your tv for your power, with what seems like standard connectors. I have no clue why they went to the trouble to have a special cord and didn't just include the power in it. They should have called it the \"Two Connect\", since you have two cords, not one.Anyway, strangest of all... Samsung made these two wires (the proprietary One Connect and the power cord) LIGHT GRAY in color. I was literally shocked to discover this. Here's this expensive, fancy, ultra-thin TV (perfect for low-profile wall mounting) with black bezel and backing... and GRAY cords that stand out like a sore thumb. I guess maybe so they blend better with a (gray) wall, if you were so inclined as to just run them down the wall exposed instead of hiding them in-wall or inside a conduit? Crazy choice on Samsung's part. But overall, just a cosmetic nitpick.Great TV otherwise."], ["5.0", "Love the TV", "Love the TV! The only issue I have is the remote control will not work with a sonos play bar.  Luckily I have DIRECTV and the remote will operate the sonos! Other than that, the TV is amazing!!"], ["5.0", "Five Stars", "fast delivery. Samsung quality decent price."], ["Just bought this TV and I can't give it 5 stars because of the Samsung one connect box and issues with audio volume and home theater control.  I have the Sonos Playbar with this TV.  Proper setup took some figuring out but you can assign the Sonos as the home theater system connected via the Toshlink cable to the one connect box.Two outstanding others should be aware of:1.  If you use the FireTV you will not be able to use the Samsung remote to control the volume of the Sonos Playbar.  Apple TV and Blue-Ray plays work fine with the Samsung remote.  So now I have 2 choices: 1 - ditch the Samsung remote and buy a smart remote like a Logitec or 2 - use a tablet or phone to control the Sonos Playbar volume via the app.2.  Not sure if it is a Samsung issue or Sonos issue but the volume output to the Sonos Playbar is very low.  Have to max out the volume to get acceptable listening level.  Didn't have this issue with my older Samsung TV (didn't have Samsung One Connect box).  Based on all the other reported issues with the One Connect box, I suspect it is a Samsung issue.", "Apple TV and Blue-Ray plays work fine with the Samsung remote", "4.0"], ["5.0", "Love the TV with one exception.  Everything I read said that I could mirror the screen from my tablet.  Not.  Won't work with Apple products.  After speaking with Tech Support learned that as far as they knew it will only work with Samsung tablets.  Other tablets may be listed eventually, but check with Samsung first.  Also, price has come down quite a bit recently.", "Love the TV with one exception"], ["5.0", "Five Stars", "Awesome TV!"], ["One Connect Quality and Poor Customer Service", "1.0", "I brought a Samsung TV UN65JS8500 in November 2015. Within less than a year, in September 2016 the One Connect Box is not working. They send me a replacement box. Today (June 2017) within less than a year later, the One Connect Box is not working again.I told them that the replacement One Connect Box is a lemon, it is not living up to basic electronic reliability or quality of at least one year. They refuse to take ownership of the problem or refuse to replace it again.This will be my last Samsung TV."]], "url": "https://www.amazon.com/dp/B06XGCT2PQ/ref=psdc_6459737011_t4_B06X9VSZYM", "description_text": ["The Samsung MU9000 Ultra HDTV redefines the viewing experience by producing over a billion rich colors with 4K Color Drive Extreme and Triple Black Extreme for a deeper High Dynamic Range (HDR) picture. Our new Smart TV user interface (UI), the new Smart Remote Controller with voice navigation capability provides faster access to your favorite streaming content choices and more."], "product_info": [["ASIN", "B06XGCT2PQ"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "84 pounds ("], ["Date First Available", "March 3, 2017"]], "seller": ["Amazon.com"], "price": 199799.0, "size": ["65-Inch"]},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.5"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/81TdkYNvmYL._SL1500_.jpg"], "product_specs": [["Brand Name", "Sony"], ["Item Weight", "77.2 pounds"], ["Product Dimensions", "69.4 x 7.5 x 37.8 inches"], ["Origin", "Mexico"], ["Item model number", "XBR-65X850E"], ["Batteries", "2 AA batteries required. (included)"], ["Color Name", "Black"]], "description_html": "", "title": ["Sony XBR65X850E 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Sony"], "stock_status": ["In Stock"], "pid": ["B01N5UZ1RG"], "extra_images": "", "reviews": [["5.0", "I made this purchase after much deliberation. I had short listed this product and the Samsung curved, price wise I believe there was just a $100 difference (Sony being higher). Being a old fan of the Sony brand, I was little biased towards this brand. The product took about 2 weeks for delivery, was delivered & installed on the TV stand by the same people who delivered. Very professional service.I had purchased the wall mount service from Amazon itself and I was extremely happy with the quality of service. The technician came right the next day, did the installation in about an hour. Was little bummed when I came to know that Comcast doesn't yet stream in 4K. But in comparison to my old Phillips (10 year old 35 inch) obviously the picture quality & overall experience is stunning.I have an Sony google TV and the setup took less than 15 min to complete.One issue that I noticed is that the Sony TV remote guide although display the TV guide, it is not changing the channels. I am still researching, it is possible the way my setup is.I will post some more reviews in a while to share my experience.", "I had purchased the wall mount service from Amazon itself and I was extremely happy with the quality of service"], ["5.0", "Really was easy, picture looks great and had a movie from ...", "After a ton of research, picked the Sony TV based on brand reputation and no past issues with Sony products.  It took about 30 minutes to setup TV (including item setup and system updates/remote setup).  Really was easy, picture looks great and had a movie from Netflix streaming in a matter of moments.  Really enjoying this set so far and highly recommend."], ["5.0", "Amazing picture quality. HDR is definitely worth it!", "Five Stars"], ["Great TV. Need 2 people to mount on wall.", "5.0", "Five Stars"], ["5.0", "Fantastic picture", "Love it, easy set up. Fantastic picture. Android smart tv."], ["Super fast shipping. Arrived safely. What an amazing tv. Super happy with it!", "5.0", "Five Stars"], ["5.0", "Very happy with this TV we shopped for about a month.  The reviews were good and after going to a few local stores to compare other brands. This one won.", "High quality TV"], ["Excellent!  Google Android operating system is great!  I love the voice search for YouTube!With AT&T U-Verse, this TV gets the TV Guide, and preview screens for all shows from online directly, bypassing the slow AT&T set top box.  Making browsing U-Verse TV much faster!", "5.0", "Excellent!  Works great with AT&T U-Verse!"]], "url": "https://www.amazon.com/dp/B01N5UZ1RG/ref=psdc_6459737011_t3_B06X9VSZYM", "description_text": ["Go beyond what you’ve seen before with remarkable 4K HDR clarity, colour and contrast. Scenes are more detailed, more natural and more real with 4K HDR Processor X1, and life’s brilliance is revealed with extra smooth and vibrant colours. And with Android TV, find all the entertainment you want."], "product_info": [["ASIN", "B01N5UZ1RG"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "77.2 pounds ("], ["Date First Available", "February 10, 2017"]], "seller": ["Amazon.com"], "price": 159800.0, "size": ["65-Inch"]},
{"category": [], "rating": [], "main_image": [], "product_specs": [], "description_html": "", "title": [], "color": [], "brand": [], "stock_status": [], "pid": ["B06XGXDDJZ"], "extra_images": "", "reviews": [], "url": "https://www.amazon.com/dp/B06XGXDDJZ/ref=psdc_6459737011_t2_B06X9VSZYM", "description_text": [], "product_info": [], "seller": [], "price": null, "size": []},
{"category": ["Electronics", "Television & Video", "Televisions"], "rating": ["4.2"], "main_image": ["https://images-na.ssl-images-amazon.com/images/I/81npPmFkYVL._SL1500_.jpg"], "product_specs": [["Brand Name", "Sony"], ["Item Weight", "77.2 pounds"], ["Product Dimensions", "64.4 x 7.5 x 37.8 inches"], ["Origin", "Mexico"], ["Item model number", "XBR65X900E"], ["Batteries", "2 AAA batteries required. (included)"], ["Color Name", "Black"]], "description_html": "", "title": ["Sony XBR65X900E 65-Inch 4K Ultra HD Smart LED TV (2017 Model)"], "color": [], "brand": ["Sony"], "stock_status": ["In Stock"], "pid": ["B01MZF81NS"], "extra_images": "", "reviews": [["5.0", "I held off purchasing a 4k TV until 2017 models were released hoping to get 4K and HDR at once. I originally looked at purchasing a Samsung KS8000 (2016 model) based on reviews but those are super hard to find now. I use rtings.com almost exclusively to compare different models and get the reviews on the major features I am looking for (HDR, wide color gamut, local dimming, and input lag). Based on what I was looking for, pretty much gaming with future potential for 4k Blu Ray, I went with the Sony XBRX900E. So far I am completely happy and satisfied with my choice. First off definitely research online and don't only base your decision from what you see at a local store. I always go into my local Best buy to get a first hand look but you can't know what you are actually getting unless you research online (specs like brightness, HDR, input lag, wide color gamut, etc). This TV is awesome when you have a PS4 pro and are going from no 4K and no HDR to this TV with those features. The games on PS4 pro that have been enhanced look awesome (Horizon XD, Shadow of Mordor, Deus Ex MD, NMD, Titan Fall 2, Ratchet and Clank, etc) night and day difference. No lag, HDR is awesome, colors and brightness make games more immersive. The smart capabilities of this TV are great for streaming 4k content (Amazon and YouTube). I've obviously never streamed 4k before since I didn't have a 4k TV but I find myself streaming random things in 4k just to see the beautiful picture. It's amazing how much random content is available to stream in 4K. I have a Vizio soundbar with a optical input and was concerned that I would have to use two different remotes. In the home screen (press the home button) there is a picture of what I initially thought was a random video labeled \"audio control setup\" it walks you through connecting the included RF blaster\" so you can control your sound bar with the Sony remote, nice. No complaints so far. If you have been looking for a 4K TV to pair with your PS4 pro or to view/stream 4K content this is a great choice.", "Great for PS4 Pro and streaming 4K content"], ["5.0", "I’ve had the 75” 4K HDTV for over a month now and overall it is a great set. However, upgrading from a Samsung HD TV, there are some things to note.OVERALL (the short version): I would recommend this TV for the picture quality alone. 5 Stars. It is magnificent! There are workarounds for the CONS listed below, so overall it’s a terrific set for 4K content as well as regular HD content. I’ve decided to start with the CONS to get them out of the way. The PROS follow below.CONS:The SONY BRAVIA 4K XBR75X900E does not seem to be able to handle internet speeds much higher than 60mbps (wired or connected by LAN). This is acceptable for streaming HD on the apps that accompany the set, but 4K content can be iffy. I tried viewing a Coral Reef video on Amazon Prime in 4K, and it took almost a minute for the picture to catch up to 4K quality. There were a few times the picture lagged. I tried watching a random standup comedy video on Netflix in 4K and the server wouldn’t connect. This was probably an issue with Netflix because when I tried again, the connection worked and seemed to hold a 4K picture in a similar way to the Amazon app. The YouTube app was the same. 4K videos lagged and took some time to catch up.Luckily, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) I purchased can handle faster internet speeds, so we use the player almost exclusively for streaming 4K content. I’ve also read other reviewers mention that Chromecast or an Fire TV Stick with Alexa Voice Remote | Streaming Media Player can handle higher internet streaming speeds, so that is something to consider. Also, the TV takes about a minute to connect to Wi-Fi after it’s turned on. Not a big deal, but worth noting. Connected to LAN, it connects a little quicker.Upscaling looks terrible when done on the TV. I wasn’t expecting this to be the issue, but once again, the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model) saved the day! Upscale regular Blu-Ray’s on the player, and the picture looks nearly as good as actual 4K. You will notice the difference. We streamed a few older shows from HULU like Cheers and Seinfeld and they looked great as well. Again, the picture quality is fantastic and worth every penny!**** HDR UPDATE ***I want to thank everyone for their comments about my negative thoughts on HDR. It forced me to do some research on the internet to figure out why HDR looked to terrible on this set. After trial and error, I finally figured it out. You see, I have a home theater system. I bought an ONKYO Receiver a few years back that was 4K compatible. I did not, however, take into consideration that it might not be HDR compatible. (It's not.) So, I was running the 4K player through an HDMI cable into the receiver first, and then into the 4K TV. Which means, no HDR content was reaching the TV. So, as one commenter pointed out, I was turning HDR on when no HDR was available, which results in my original comments below, the picture is dark and the colors look cartoonish.I WAS WRONG!! And I'm glad I was wrong. Nobody likes eating crow, but I am happy to do it after I saw HDR for the first time last night. It is awesome! The colors look amazing, the blacks are really dark, and the whites are really white. My wife and I watched Coral Reef Adventure under the Prime UHD selection from the Amazon app directly on the TV. HDR turned on automatically (as a commenter mentioned it should), and WOW!! It looked spectacular.If you, or anyone you know, is experiencing a bad picture when turning HDR on, they must first realize that not all 4K content is presented with HDR. But what really fixed my situation is this: Run the HDMI directly from the 4K Player to the HDMI \"1\" slot in the back of the TV. That's all it took to make HDR a reality, the way it was intended.I'm keeping the original comments in the review in the hopes of helping anyone else who experiences this issue. Thank you again for the comments about how HDR should work. You guys are the best!***********************************************************************************************************************************************************************************************ORIGINAL COMMENTS*HDR is terrible. This is not the fault of the set, but I want to talk about it here because it’s not worth turning on. If it works for you because of bright lighting in the room or whatever, go for it. But for my wife and I, HDR is not needed. Basically, it’s an artificial layer added to the original picture source to “enhance” things. After several days of tweaking with the settings, trying multiple HDR enabled discs, etc., the picture only got worse with HDR turned on. All it seems to do is make every scene darker, a LOT darker. The HDR effect on colors can be weird. There is a slight red push over flesh tones, and sometimes the colors appear cartoonish, like they were drawn in with crayons. It’s gimmicky, at best. So, if you’re new to 4K, and you’re worried that this set won’t support Dolby Vision, don’t worry too much about it. The 4K picture alone is beautiful you won’t be disappointed with the picture as it is.Also, on the subject of HDR: There are three options, ON, OFF, and AUTO. The only time HDR will turn on is when the HDR setting is switched specifically to ON. If set to AUTO, it might as well be set to OFF because it will never turn on automatically.**********************************************************************************************************************************************************************************************PROS:The picture is beautiful! It is a vast improvement over the regular HD picture from our older TV (which looked great as far as 1080P goes). There are many settings to tweak the set to your liking, and the LIVE FOOTBALL mode is perfect for games. When you watch 4K content, you can get up right next to the screen and see amazing details in the background. You probably don’t want to watch a movie right up close to the screen, but sometimes it’s fun to check out the details of things in the distance.My wife and I have watched Blu-Ray movies and UHD 4K movies from discs as well as streaming 4K content (using the separate 4K player), and they all look great. Regular DVD’s leave a little to be desired, but I knew that going in, so it’s not much of a surprise. What sells this set is the picture! And let’s be honest, this is what you’re looking for in a 75” 4K UHD set. It is spectacular for HD and 4K content! Spectacular!Games and Apps: I play Uncharted 4 on a regular PS4 (not the pro) and the details in color are phenomenal. WOW!! I can’t imagine the game looking any better on a PS4 Pro, but I’d have to do a side by side comparison to really tell the difference.*A NOTE ON SCREEN MIRRORING: If you have a Samsung Galaxy smartphone, it probably will not connect to the TV. The phone will locate the set, but won't connect. SOLUTION: Use Chromecast or (once again) the Sony UBP-X800 4K Ultra HD Blu-ray Player (2017 Model)", "The picture quality is fantastic and worth every penny!"], ["5.0", "Inky black OLED like experience at a fraction of the cost!", "I was bent on getting a 75 inch TV and I really wanted to get OLED; that left the LG TV with a $20,000 price tag. So, next, I was bent on getting a Samsung because I like the brightness of their screens. Samsung is charging $6000 for their 65\" QLED technology which is barely the next generation of technology. Looking at the Rtings website reviews for best 75 inch TVs, they mentioned that the best mid range 75 inch TV was this Sony 75\" X900E. I did the research. It is not OLED in terms of measurable quantities (it is very good) but I will tell you that the actual viewing experience is 99% of what it is with an OLED TV. The blacks are inky wet black and the the brights are amazing. I can watch this TV outside and it looks great. It very bright. The aesthetics are beautiful. It has a very small bezel, a the glass front has the same allure as fine crystal. It has plenty of adjustments for those who like to tweak and I think it looks great with the settings out of the box. The picture quality, is just amazing and again I can't stress enough how beautiful the HDR (High Dynamic Range) is. Deep rich blacks, plenty of mid tones and excellent highlights. For the price difference I would buy this TV every time and not really miss any real perceivable differences in OLED.  Sony deserves a huge compliment for creating such a beautiful TV and picture as such a great price. I got mine for approximately $3200 and that is great at this point in time.If you are looking for a beautiful TV and picture, especially one in the 75 inch class, mid range and reasonable pricing then this is your TV!"], ["Picture quality is wonderful and the TV was super easy to set-up.  I was disappointed that the TV didn't have component audio out.....I didn't think to check before purchasing. Also, there have been a few times when the TV would not switch from the Google OS to TV...a restart was needed. After a software update that hasn't been happening as often.  Overall, pretty happy with the TV and would purchase again.", "4.0", "Great TV"]], "url": "https://www.amazon.com/dp/B01MZF81NS/ref=psdc_6459737011_t1_B06X9VSZYM", "description_text": ["Enjoy 4K HDR entertainment on our X900E with Android TV. With a full-array backlight and five times the dynamic range, this television offers incredible contrast. And with the powerful performance of the 4K HDR Processor X1, It takes even non-HDR content to near 4K HDR quality."], "product_info": [["ASIN", "B01MZF81NS"], ["Customer Reviews", ""], ["Best Sellers Rank", ""], ["Shipping Weight", "77.2 pounds ("], ["Date First Available", "February 10, 2017"]], "seller": ["Amazon.com"], "price": 199800.0, "size": ["65-Inch"]}